000_РОЗНИЦА_ЦЕНТР/src/Documents/ПриемкаРекламныхМатериалов/ПриемкаРекламныхМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемкаРекламныхМатериалов</name>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКПриемке</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеМатериалы</name>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРаспоряжение</name>
      <type>
        <types>DocumentRef.РаспоряжениеНаПриемку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/РекламныеМатериалыКПриемке/РекламныеМатериалыКПриемке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РекламныеМатериалыКПриемке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РекламныйМатериал</name>
    <type>
      <types>CatalogRef.РекламныеМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекламнаяПлоскость</name>
    <type>
      <types>CatalogRef.РекламныеПлоскости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРаспоряжение</name>
    <type>
      <types>DocumentRef.РаспоряжениеНаПриемку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ПриемкаРекламныхМатериалов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение,
		|	СУММА(РекламныеМатериалыКПриемкеОстатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКПриемке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКПриемкеОстатки
		|ГДЕ
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаС <= &Период
		|	И РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо >= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение,
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
Объект.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить())	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда 	
		Объект.Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Магазин) тогда 	
		Объект.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ответственный) тогда 	
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;    	

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01
	
КонецПроцедуры
